""" 1. Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.

*Примеры: *

- 5, 25 -> да
- 4, 16 -> да
- 25, 5 -> да
- 8, 9 -> нет """

""" a = int(input("Введите число a >>  "))
b = int(input("Введите число b >>  ")) """

""" if a**2 == b:
    print(f'Число {a} является квадратом числа {b}')  # вывод
else:
    print("Квадрат числа " + a + " не является квадратом числа " + b)

print(c) """
""" 
a = int(input("Введите число 1 >>  "))
b = int(input("Введите число 2 >>  "))
c = int(input("Введите число 3 >>  "))
d = int(input("Введите число 4 >>  "))
e = int(input("Введите число 5 >>  "))
max = a

if b > max:
    max = b
if c > max:
    max = c
if d > max:
    max = d
if d > max:
    max = d
if e > max:
    max = d

print(max) """

""" a = int(input("Введите число 1 >>  "))
b = int(input("Введите число 2 >>  "))
c = int(input("Введите число 3 >>  "))
d = int(input("Введите число 4 >>  "))
e = int(input("Введите число 5 >>  ")) """

""" a = int(input("Введите число 1 >>  "))
b = int(input("Введите число 2 >>  "))
c = int(input("Введите число 3 >>  "))
d = int(input("Введите число 4 >>  "))
e = int(input("Введите число 5 >>  "))
"""  """
lst = []




print(lst) """

""" n = int(input("Введите число n >>  "))

for i in range(-n, n+1):
    print(i, end='')
 """

# Показать 1 цифру дробного числа
# 6.85   = 8


a = 6.85
a = a*10
print(a)
a = int(a)
print(a)
print(a % 10)


st = str(a)
print(st)

d = st.find[d-1]

print(d)
